export const sceneConfigurations = [
    {
        background: ["./images/2.png"],
        btns: ["Кошка", "Внучка", "Мышка"],
        dialogue: ["Кто из героев сказки тянул репку после Жучки?"],
    },
    {
        background: ["./images/3.png"],
        btns: ["Корова", "Конь", "Бык", "Курица"],
        dialogue: ["Сивка-Бурка это?"],
    },
    {
        background: ["./images/4.png"],
        btns: ["Злая мачеха", "Баба-Яга", "Змей Горыныч"],
        dialogue: ["Кто обижает добрую девочку-сироту в сказке «Морозко»?"],
    },
    {
        background: ["./images/5.png"],
        btns: ["На деревянных", "На курьих", "На железных", "На бетонных"],
        dialogue: ["На каких ножках стоит дом Бабы-Яги?"],
    },
    {
        background: ["./images/6.png"],
        btns: ["Николай", "Салтан", "Афрон", "Алексей", "Добрыня"],
        dialogue: ["Имя царя, у которого Иван-царевич украл Жар-птицу?"],
    },
    {
        background: ["./images/7.png"],
        btns: ["Кровать", "Печь", "Пол", "Парк"],
        dialogue: ["Какое самое любимое место Иванушки-дурачка для сна и отдыха?"],
    },
    {
        background: ["./images/1.png"],
        btns: ["Дед", "Мышка", "Баба", "Курица"],
        dialogue: ["Кто разбил золотое яйцо?"],
    },
    {
        background: ["./images/8.png"],
        btns: ["Зайчика", "Медведя"],
        dialogue: ["Избушку какого героя заняла коза-дереза?"],
    },
    {
        background: ["./images/9.png"],
        btns: ["Три раза перекувыркнулся через голову", "Выпил волшебной воды", "Искупался в чистой реке"],
        dialogue: ["Иванушка стал козленочком, когда выпил воду из козьего копытца. А как он снова стал мальчиком?"],
    },
    {
        background: ["./images/10.png"],
        btns: ["Сороки-вороны", "Гуси-лебеди", "Утки-крякушки"],
        dialogue: ["Птицы, которые унесли братца, в то время как сестрица загулялась-заигралась, были?"],
    },
    {
        background: ["./images/11.png"],
        btns: ["Молочко", "Зернышко", "Горошек"],
        dialogue: ["Что предлагала лиса петушку, чтобы он выглянул в окошко?"],
    },
    {
        background: ["./images/1.png"],
        btns: ["Земля", "Трава", "Вода"],
        dialogue: ["Что в сказке «Иван-царевич и серый волк» называется «живой» и «мертвой»"],
    },
    {
        background: ["./images/1.png"],
        btns: ["Суп", "Кашу", "Оладушек", "Пюре"],
        dialogue: ["Какой продукт лиса размазала по тарелке и подала журавлю в сказке «Лиса и журавль»?"],
    },
    {
        background: ["./images/1.png"],
        btns: ["Чудо-юдо", "Волк", "Медведь"],
        dialogue: ["Кто сломал теремок в сказке «Теремок»?"],
    },
];

export const userName = 'Иван';

export const dialogsConfigurations = [
    {
        btns: ["Далее..."],
        dialogue: ["Добро пожаловать в игру./nПриветствуем тебя ученик(имя ползователя), приглашаем тебя, окунуться в 'Мир сказок', место где ты узнаешь новых, или вспомнишь старых, друзей из любимых книг.Присоединяйся к нам."],

    },
    {
        dialogue: ["Напиши своё имя, и выбери персонажа.Так мы и познакомимся."],
    },
    {
        btns: ["Поехали"],
        dialogue: [`Здравствуй ${userName}, я Бабушка, и у меня беда, книжка упала, и все герои перемешались, я уже старенькая, и самой мне их не собрать, поможешь мне это сделать?Тогда в путь!`],
    },
    {
        btns: ["Да"],
        dialogue: [`Молодец ${userName}, начинает получаться.Так же, как и в сказке 'Репка', мы помогаем друг другу, идём дальше?`],
    },
    {
        btns: ["Далее..."],
        dialogue: ["Посмотри впереди девочка, ей нужна помощь, давай скорей поможем ей!"],
    },
    {
        btns: ["Далее..."],
        dialogue: ["Обижать людей нехорошо, а что это за странный дом впереди?"],
    },
    {
        btns: ["Далее..."],
        dialogue: [`Мяу-мяу, ну что ж приятно познакомиться ${userName}, я Кот учёный, бабушкин друг, пойдём покажу, что ещё в книге нужно расставить по местам.`],
    },
    {
        btns: ["Далее..."],
        dialogue: ["Что ж, надёюсь мы не ошиблись,пойдём дальше."],
    },
    {
        btns: ["Далее..."],
        dialogue: ["Кто это у нас тут отдыхает,давайка узнаем."],
    },
    {
        btns: ["Далее..."],
        dialogue: [`Так держать ${userName},не сбавляем темп!Мур-мяу.`],
    },
    {
        btns: ["Далее..."],
        dialogue: [`Ну как тебе ${userName}?Не слишком сложно?Всё получится, нужно помочь ещё паре героев, вперёд.`],
    },
    {
        btns: ["Далее..."],
        dialogue: ["Что ж, думаю мы на правильном пути!"],
    },
    {
        btns: ["Далее..."],
        dialogue: ["Что ж, думаю мы на правильном пути!"],
    },
    {
        btns: ["Далее..."],
        dialogue: ["Что ж, думаю мы на правильном пути!"],
    },
    {
        btns: ["Результат"],
        dialogue: ["Молодец, мы очень ценим твою помощь, пришло время узнать результат."],
    },
];
